controllers/AtletismoController.php

SELECT * FROM `evento` WHERE eve_id = 34
SELECT * FROM `categoria` WHERE cat_id = 5
SELECT * FROM `tipo_deporte` WHERE td_id = 1
SELECT * FROM `deporte` WHERE dep_id = 4
SELECT * FROM `genero` WHERE gen_id = 2
---
    public function actionData(){

        //Columnas a consultar
        $columns = array(
            array( 'db' => 'camp_id', 'dt' => 0),
            array( 'db' => 'eve_id', 'dt' => 1 ,
                    'formatter' => function( $d, $row ) {
                            return \app\models\Evento::find()->where('eve_id = '.$d)->one()->eve_nombre;
                    }
                ),
            array( 'db' => 'camp_nombre', 'dt' => 2 ),
            array( 'db' => 'cat_id', 'dt' => 3,
                    'formatter' => function( $d, $row ) {
                            return \app\models\Categoria::find()->where('cat_id = '.$d)->one()->cat_nombre;
                    }
                ),
            array( 'db' => 'tipo_deporte_id', 'dt' => 4,
                'formatter' => function( $d, $row ) {
                        return \app\models\TipoDeporte::find()->where('td_id = '.$d)->one()->td_nombre;
                }
            ),
            array( 'db' => 'dep_id', 'dt' => 5,
                'formatter' => function( $d, $row ) {
                        return \app\models\Deporte::find()->where('dep_id = '.$d)->one()->dep_nombre;
                }
            ),
            array( 'db' => 'genero_id', 'dt' => 6,
                'formatter' => function( $d, $row ) {
                        return \app\models\Genero::find()->where('gen_id = '. $d)->one()->gen_nombre;

SELECT * FROM `prueba` WHERE prueb_id = 83
---
            ),
            array( 'db' => 'prueb_id', 'dt' => 7,
                'formatter' => function( $d, $row ) {
                        return \app\models\Prueba::find()->where('prueb_id = '. $d)->one()->prueb_nombre;

SELECT COUNT(*) FROM `fase_tiene_encuentros` LEFT JOIN `campeonato_tiene_fases` `ctf` ON fase_tiene_encuentros.ctf_id = ctf.ctf_id WHERE ctf.camp_id = 40
---
            array( 'db' => 'camp_id', 'dt' => 8 ,
                'formatter' => function( $d, $row ) {
                        $r = 0;
                        $total = \app\models\FaseTieneEncuentros::find()
                            ->leftJoin('campeonato_tiene_fases ctf', 'fase_tiene_encuentros.ctf_id = ctf.ctf_id')
                            ->where('ctf.camp_id = '.$d)->count();

SELECT * FROM `deporte` WHERE dep_id = 4
SELECT * FROM `evento` WHERE eve_activo =1 ORDER BY `eve_id` DESC
SELECT * FROM `categoria`
SELECT * FROM `tipo_deporte`
SELECT * FROM `genero`
SELECT * FROM `prueba`
SELECT * FROM `departamentos`
SELECT * FROM `municipios`
SELECT `escenario`.* FROM `escenario` LEFT JOIN `escenario_tiene_deportes` `etd` ON escenario.esc_id = etd.esc_id WHERE esc_activo = 1 and etd.dep_id = 4
---
    public function actionListar(){

        $deporte = \app\models\Deporte::find()->where('dep_id = '.ID_ATLETISMO)->one();
        $eventos = ArrayHelper::map(\app\models\Evento::find()->where('eve_activo ='. ESTADO_ACTIVO)->orderBy('eve_id desc')->all(),'eve_id','eve_nombre');
        $categorias = ArrayHelper::map(\app\models\Categoria::find()->all(),'cat_id','cat_nombre');
        $tipoDeporte = ArrayHelper::map(\app\models\TipoDeporte::find()->all(),'td_id','td_nombre');
        //$deportes = ArrayHelper::map(\app\models\Deporte::find()->all(),'dep_id','dep_nombre');
        $genero = ArrayHelper::map(\app\models\Genero::find()->all(),'gen_id','gen_nombre');
        $pruebas = ArrayHelper::map(\app\models\Prueba::find()->all(),'prueb_id','prueb_nombre');


        $dptos = ArrayHelper::map(\app\models\Departamentos::find()->all(), 'dptos_id','dptos_name');
        $mcipios = ArrayHelper::map(\app\models\Municipios::find()->all(), 'municipios_id','municipios_name');

        $escenarios = ArrayHelper::map(\app\models\Escenario::find()
                ->leftJoin('escenario_tiene_deportes etd', 'escenario.esc_id = etd.esc_id')
                ->where('esc_activo = '.ESTADO_ACTIVO." and etd.dep_id = ".$deporte->dep_id)
                ->all(),'esc_id','esc_nombre');

SELECT * FROM `departamentos` WHERE `dptos_id`='34'
SELECT * FROM `municipios` WHERE `municipios_id`='1149'
SELECT * FROM `equipo_tiene_deportistas` WHERE `dep_id`='1152949'
SELECT * FROM `deportista_tiene_numero` WHERE `etd_id`=220047
---
    public function actionDatadeportistas(){
        $columns = array(
            array('db' => 'ent_dpto', 'dt' => 0,
                'formatter' => function($d, $row){
                    return \app\models\Departamentos::find()->where(['dptos_id'=> $d])->one()->dptos_name;
                }
            ),
            array('db' => 'ent_municipio', 'dt' => 1,
                'formatter' => function($d, $row){
                    return \app\models\Municipios::find()->where(['municipios_id'=> $d])->one()->municipios_name;
                }
            ),
            array('db' => 'ent_nombre', 'dt' => 2),
            array('db' => 'nombres', 'dt' => 3),
            array('db' => 'usu_num_doc', 'dt' => 4),
            array('db' => 'dep_id', 'dt' => 5,
                'formatter' => function($d, $row){
                	$etd = \app\models\EquipoTieneDeportistas::find()->where(['dep_id'=> $d])->one();
                	if(isset($etd)){
                		$numero = \app\models\DeportistaTieneNumero::find()->where(['etd_id'=>$etd->etd_id])->one();

SELECT * FROM `view_deportistas` WHERE ent_dpto = 34 ORDER BY `ent_dpto`
---
    public function actionGenerarreporte(){
    	// Filtros
    	$evento = $_POST['eve_id_num_dep']; // igual
    	$categoria = $_POST['cat_id']; // igual
    	$genero = $_POST['gen_id']; // igual
    	$list ="";

    	if ($_POST['dptos_id2'] != "") {
    		$list .= "ent_dpto = ".$_POST['dptos_id2'];
    	}
    	if ($_POST['municipios_id2'] != "") {
    		($list != "") ? $list .= " AND ": $list .= "";
    		$list .= "ent_municipio = ".$_POST['municipios_id2'];
    	}
    	if($_POST['inst'] != ""){
    		($list != "") ? $list .= " AND ": $list .= "";
    		$list .= "ent_nombre LIKE '%".$_POST['inst']."%'";
    	}
    	if($_POST['nom'] != ""){
    		($list != "") ? $list .= " AND ": $list .= "";
    		$list .= "nombres LIKE '%".$_POST['nom']."%'";
    	}
    	if($_POST['doc'] != ""){
    		($list != "") ? $list .= " AND ": $list .= "";
    		$list .= "usu_num_doc LIKE '%".$_POST['doc']."%'";
    	}
    	$deportistas = \app\models\ViewDeportistas::find()->where($list)->orderBy('ent_dpto')->all();

SELECT * FROM `departamentos` WHERE `dptos_id`=34
SELECT * FROM `municipios` WHERE `municipios_id`=1152
SELECT * FROM `equipo_tiene_deportistas` WHERE `dep_id`=942849
SELECT * FROM `deportista_tiene_numero` WHERE `etd_id`=212969
---
    public static function guardarPDF($deportistas){
        require("../helpers/dompdf/dompdf_config.inc.php");
        $dompdf = new \DOMPDF();
        $dompdf->set_paper("A4", "portrait");
        $html = "<h1>".Yii::t('app', 'ASIGNACION_NUMEROS')."</h1><hr>
                <table border='2'>
                    <tr>
                        <th>".Yii::t('app', 'DEPARTAMENTO')."</th>
                        <th>".Yii::t('app', 'CIUDAD')."</th>
                        <th>".Yii::t('app', 'INSTITUCION/EQUIPO')."</th>
                        <th>".Yii::t('app', 'NOMBRE')."</th>
                        <th>".Yii::t('app', 'DOCUMENTO')."</th>
                        <th>".Yii::t('app', 'NUMERO')."</th>
                    </tr>";
        foreach ($deportistas as $dep) {
            $html .= "<tr>
                        <td>".\app\models\Departamentos::find()->where(['dptos_id'=>$dep->ent_dpto])->one()->dptos_name."</td>
                        <td>".\app\models\Municipios::find()->where(['municipios_id'=>$dep->ent_municipio])->one()->municipios_name."</td>
                        <td>".$dep->ent_nombre."</td>
                        <td>".$dep->nombres."</td>
                        <td>".$dep->usu_num_doc."</td>";
            $etd = \app\models\EquipoTieneDeportistas::find()->where(['dep_id'=> $dep->dep_id])->one();
                if(isset($etd)){
                    $numero = \app\models\DeportistaTieneNumero::find()->where(['etd_id'=>$etd->etd_id])->one();