controllers/CampeonatoController.php

SELECT * FROM `deporte` WHERE dep_estado = 1
---
    public function actionTorneos(){
        $deportes = \app\models\Deporte::find()->where('dep_estado = '.ESTADO_ACTIVO)->all();

SELECT * FROM `deporte` WHERE dep_id = 4
SELECT * FROM `evento` WHERE eve_activo =1 ORDER BY `eve_id` DESC
SELECT * FROM `categoria`
SELECT * FROM `tipo_deporte`
SELECT * FROM `genero`
SELECT * FROM `prueba`
---
    public function actionListar(){

        $deporte = \app\models\Deporte::find()->where('dep_id = '.$_GET['idDeporte'])->one();
        $eventos = ArrayHelper::map(\app\models\Evento::find()->where('eve_activo ='. ESTADO_ACTIVO)->orderBy('eve_id desc')->all(),'eve_id','eve_nombre');
        $categorias = ArrayHelper::map(\app\models\Categoria::find()->all(),'cat_id','cat_nombre');
        $tipoDeporte = ArrayHelper::map(\app\models\TipoDeporte::find()->all(),'td_id','td_nombre');
        //$deportes = ArrayHelper::map(\app\models\Deporte::find()->all(),'dep_id','dep_nombre');
        $genero = ArrayHelper::map(\app\models\Genero::find()->all(),'gen_id','gen_nombre');
        $pruebas = ArrayHelper::map(\app\models\Prueba::find()->all(),'prueb_id','prueb_nombre');