controllers/EscenarioController.php

SELECT * FROM `deporte` WHERE `dep_estado`=1 ORDER BY `dep_nombre`
SELECT * FROM `departamentos` ORDER BY `dptos_name`
SELECT * FROM `municipios` ORDER BY `municipios_name`
---
    public function actionListar(){
        $deportesActivos = ArrayHelper::map(\app\models\Deporte::find()->where(['dep_estado'=>ESTADO_ACTIVO])->orderBy('dep_nombre')->all(),'dep_id','dep_nombre');
        $dptos = ArrayHelper::map(\app\models\Departamentos::find()->orderBy('dptos_name')->all(), 'dptos_id','dptos_name');
        $horas = EscenarioController::listarHoras();
        $ciudad = ArrayHelper::map(\app\models\Municipios::find()->orderBy('municipios_name')->all(),'municipios_id', 'municipios_name');

SELECT * FROM `escenario` WHERE `esc_id`='46'
SELECT * FROM `contacto_escenario` WHERE `ce_id` IS NULL
SELECT * FROM `municipios` WHERE `municipios_id`=1036
SELECT * FROM `hora`
SELECT * FROM `disponibilidad_tiene_hora` WHERE `de_id`=225
---
    public function actionModalescenario(){
    	$escenario = Escenario::find()->where(['esc_id' => $_GET['id']])->one();
    	$contacto = ContactoEscenario::find()->where(['ce_id' => $escenario->ce_id])->one();
    	$deportesEscenario = EscenarioController::listarDeportesEscenario($_GET['id']);
    	$ciudadEscenario = \app\models\Municipios::find()->where(['municipios_id' => $escenario->loc_id])->one();
    	$disponibilidad = EscenarioController::listarDisponibilidad($escenario->esc_id);
    	$horas = \app\models\Hora::find()->all();
    	$r = [];
    	$r['escenario'] = $escenario->attributes;
    	if(isset($contacto)){
    		$r['contacto'] = $contacto->attributes;
    	}
    	$num = 0;
    	foreach ($deportesEscenario as $d) {
    		$r['dep'.$num] = $d->attributes;
    		$num++;
    	}
    	$num = 0;
    	$num1 = 0;
    	$r['ciudad'] = $ciudadEscenario->attributes;
    	$r['depto'] = $ciudadEscenario->municipiosDptosCode->attributes;
    	foreach ($disponibilidad as $dis) {
    		$r['disp'.$num] = $dis->attributes;
    		$dispTieneHora = \app\models\DisponibilidadTieneHora::find()->where(['de_id'=>$dis->de_id])->all();

SELECT * FROM `municipios` WHERE `municipios_id`='35'
SELECT * FROM `contacto_escenario` WHERE `ce_id` IS NULL
---
    public function actionEscenarios(){
        //Columnas a consultar
        $columns = array(
            array('db' => 'esc_id', 'dt' => 0),
            array('db' => 'esc_nombre', 'dt' => 1),
            array('db' => 'esc_direccion', 'dt' => 2),
            array(
                'db' => 'loc_id',
                'dt' => 3,
                'formatter' => function($d, $row){
                	$ciudad = \app\models\Municipios::find()->where(['municipios_id' => $d])->one();
                    if(isset($ciudad)){
                        return $ciudad->municipios_name." - ".$ciudad->municipiosDptosCode->dptos_name;
                    }else{
                        return "";
                    }

                }
            ),
            array(
                'db' => 'ce_id',
                'dt' => 4,
                'formatter' => function($d, $row){
                	// return ContactoEscenario::findOne($d)->ce_nombre;
                    $contacto = ContactoEscenario::find()->where(['ce_id' => $d])->one();

INSERT INTO `disponibilidad_escenario` (`de_fecha_ini`, `de_fecha_fin`, `esc_id`) VALUES ('2017-09-25', '2017-09-28', 68)
INSERT INTO `disponibilidad_tiene_hora` (`hor_id`, `de_id`) VALUES (10, 283)
---
    public function actionAgregardisponibilidad(){
        $fechaInicio = $_GET['fi'];
        $fechaFin = $_GET['ff'];
        $horas = [];
        for($i = 1; $i <= HORAS; $i++){
            if(isset($_GET['h'.$i])){
                $horas[] = $_GET['h'.$i];
            }
        }
        $disponibilidad = new DisponibilidadEscenario();
        $disponibilidad->de_fecha_ini = $fechaInicio;
        $disponibilidad->de_fecha_fin = $fechaFin;
        if($_GET['idEsc'] != 0){
            $disponibilidad->esc_id = $_GET['idEsc'];
        }
        $validacion = $disponibilidad->validate();
        if($validacion){
            $insert = $disponibilidad->insert();
            if($insert){
                $ultimo = $this->listarDisponibilidad(0);
                for($j = 0; $j < sizeof($horas); $j++){
                    $disp_hora = new DisponibilidadTieneHora();
                    $disp_hora->hor_id = $horas[$j];
                    $disp_hora->de_id = $ultimo;
                    $disp_hora->insert();

SELECT * FROM `disponibilidad_escenario` WHERE `esc_id` IS NULL ORDER BY `de_id`
DELETE FROM `disponibilidad_escenario` WHERE esc_id is null
---
    public function actionBorrardisponibilidad(){
        $id = $_GET['idDis'];
        $de = DisponibilidadEscenario::find()->where(['de_id'=> $id])->one();
        if($_GET['idEsc'] == '0'){
            DisponibilidadTieneHora::deleteAll('de_id = '.$id);
            $disponibilidad = DisponibilidadEscenario::findOne($id);
            $borrar = $disponibilidad->delete();
            echo json_encode(EscenarioController::actualizarVisualizacion(-1));
        }else{
            if(sizeof(DisponibilidadEscenario::find()->where(['esc_id'=>$_GET['idEsc']])->all())==1){
                $msj = "<tr id='msj-u'><td colspan='5'><p style='color:red;' id='msnDispMinima'>".Yii::t('app',"DISPONIBILIDAD_MINIMA_ERROR")."</p><br></td></tr>";
                $msj.=EscenarioController::actualizarVisualizacion($_GET['idEsc']);
                echo json_encode($msj);
            }else{
                DisponibilidadTieneHora::deleteAll('de_id = '.$id);
                $disponibilidad = DisponibilidadEscenario::findOne($id);
                $borrar = $disponibilidad->delete();

SELECT * FROM `municipios` WHERE `municipios_dptos_code`='3'
---
    public function actionListarciudades(){
        $id = $_GET['id'];
        $ciu = ArrayHelper::map(\app\models\Municipios::find()->where(['municipios_dptos_code'=>$id])->all(),'municipios_id','municipios_name');

SELECT * FROM `escenario_tiene_deportes` WHERE (`esc_id`='60') AND (`estd_activo`=1)
SELECT * FROM `escenario_tiene_deportes` WHERE (`esc_id`='60') AND (`dep_id`='3')
---
    public function actionBorrardeporteescenario(){
        if(sizeof(EscenarioTieneDeportes::find()->where(['esc_id'=>$_GET['idEsc'],'estd_activo'=>1])->all()) == 1){
            echo false;
        }else{
            $escTieneDep = EscenarioTieneDeportes::find()->where(['esc_id'=>$_GET['idEsc'], 'dep_id'=> $_GET['idDep']])->one();

SELECT * FROM `escenario_tiene_deportes` WHERE (`esc_id`='68') AND (`dep_id`='2')
INSERT INTO `escenario_tiene_deportes` (`esc_id`, `dep_id`, `estd_activo`) VALUES (68, 2, 1)
---
    public function actionAgregardeporteescenario(){
        if(!EscenarioTieneDeportes::find()->where(['esc_id'=>$_GET['idEsc'],'dep_id'=>$_GET['idDep']])->one()){
            // if(EscenarioTieneDeportes::find()->where(['esc_id'=>$_GET['idEsc'],'dep_id'=>$_GET['idDep'],'estd_activo'=>0])->one()){
            //     $escenario = EscenarioTieneDeportes::find()->where(['esc_id'=>$_GET['idEsc'],'dep_id'=>$_GET['idDep'],'estd_activo'=>0])->one();
            //     $escenario->estd_activo = 1;
            //     if($escenario->update()){
            //         echo true;
            //     }else{
            //         echo false;
            //     }
            // }else{
            $etd = new EscenarioTieneDeportes();
            $etd->esc_id = $_GET['idEsc'];
            $etd->dep_id = $_GET['idDep'];
            $etd->estd_activo = 1;
            if($etd->insert()){

SELECT EXISTS(SELECT * FROM `escenario` WHERE (`escenario`.`esc_id`='68'))
SELECT * FROM `escenario` WHERE `esc_id`='60'
UPDATE `escenario` SET `loc_id`=1119 WHERE `esc_id`=60
---
    public function actionCambiarciudadescenario(){
        $escenario = Escenario::find()->where(['esc_id'=>$_GET['idEsc']])->one();
        $escenario->loc_id = $_GET['idLoc'];
        if($escenario->update()){

SELECT * FROM `disponibilidad_escenario` WHERE `esc_id`='68'
SELECT * FROM `disponibilidad_tiene_hora` WHERE `de_id`=283
---
    public function actionValidarfechadisp(){
        if($_GET['esc_id'] == 0){
            $esc = null;
        }else{
            $esc = $_GET['esc_id'];
        }

        $r = [];
        $validador = true;
        $dispo = \app\models\DisponibilidadEscenario::find()->where(['esc_id' => $esc])->all();
        foreach ($dispo as $disp) {
            if($disp->de_id != $_GET['idDis']){
                if($_GET['fi'] >= $disp->de_fecha_ini && $_GET['fi'] <= $disp->de_fecha_fin){
                    $validador = false;
                }else if($_GET['ff'] >= $disp->de_fecha_ini && $_GET['ff'] <= $disp->de_fecha_fin){
                    $validador = false;
                }else if($_GET['fi'] <= $disp->de_fecha_ini && $_GET['ff'] >= $disp->de_fecha_fin){
                    $validador = false;
                }
                if($validador == false){
                    $horas = \app\models\DisponibilidadTieneHora::find()->where(['de_id'=>$disp->de_id])->all();

SELECT * FROM `disponibilidad_escenario` WHERE `esc_id` IS NULL ORDER BY `de_id`
SELECT * FROM `disponibilidad_escenario` ORDER BY `de_id` DESC
SELECT * FROM `disponibilidad_escenario` WHERE `esc_id`='68' ORDER BY `de_id`
---
    public static function listarDisponibilidad($opc){
        if($opc == -1){
            return DisponibilidadEscenario::find()->where(['esc_id' => null])->orderBy('de_id')->all();
        }else if($opc == 0){
            return  DisponibilidadEscenario::find()->orderBy('de_id DESC')->one()->de_id;
        }else{
            return DisponibilidadEscenario::find()->where(['esc_id' => $opc])->orderBy('de_id')->all();

DELETE FROM `disponibilidad_escenario` WHERE esc_id is null
---
    public static function limpiarDisponibilidad(){
        $disp = EscenarioController::listarDisponibilidad(-1);
        foreach ($disp as $d) {
            DisponibilidadTieneHora::deleteAll('de_id = '.$d->de_id);
        }
        $n = null;
        DisponibilidadEscenario::deleteAll('esc_id is null ');

SELECT * FROM `hora`
---
    public static function listarHoras(){
        return Hora::find()->all();

SELECT * FROM `disponibilidad_tiene_hora` WHERE `de_id`=283
---
    public static function listarHorasPorFecha($id){
        $vista ="";
        $horas = EscenarioController::listarHoras();
        $horasDisp = DisponibilidadTieneHora::find()->where(['de_id'=>$id])->all();

SELECT * FROM `escenario_tiene_deportes` WHERE (`esc_id`='46') AND (`estd_activo`=1)
---
    public static function listarDeportesEscenario($id){
        $escTieneDeport = EscenarioTieneDeportes::find()->where(['esc_id'=> $id,'estd_activo'=>1])->all();